# Unit 2 Optimal Data Exploration Through Pandas

## Unit 2.2 Pandas Series and DataFrames

In [4]:
import numpy as np
import pandas as pd

Vamos a crear una serie pandas a partir de una lista:

In [5]:
pd.Series(['Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Female'])

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6    Female
dtype: object

También es posible crear una serie a partir de un ndarray Numpy:

In [6]:
ser = pd.Series(np.array(['Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Female']))
ser

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6    Female
dtype: object

In [7]:
type(ser)

pandas.core.series.Series

Veamos cómo crear una serie Pandas a partir e un diccionario:

In [10]:
dict_data = {'a':1, 'b':2, 'c':3}

In [12]:
ser1 = pd.Series(dict_data)
ser1

a    1
b    2
c    3
dtype: int64

In [13]:
type(ser1)

pandas.core.series.Series

In [14]:
ser1.index

Index(['a', 'b', 'c'], dtype='object')

In [15]:
ser1.values

array([1, 2, 3])

Veamos cómo es el índice de una serie creada a partir de una lista:

In [16]:
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]

In [17]:
ser2 = pd.Series(list_data)
ser2

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [18]:
ser2.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
ser2.values

array(['2019-01-02', 3.14, 'ABC', 100, True], dtype=object)

In [20]:
type(ser2.values)

numpy.ndarray

Ahora vamos a crear DataFrames:

In [30]:
df = pd.DataFrame({'Name':['Braund, Mr. Owen Harris',
                          'Allen, Mr. William Henry',
                          'Bonnell, Miss. Elizabeth'],
                  'Age':[22, 35, 58],
                  'Sex':['male','male','female']})
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

podemos acceder a una columna con su nombre:

In [31]:
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [33]:
type(df['Age']) # una columna es una serie Pandas

pandas.core.series.Series

Accediendo a un elemento de la serie podemos localizar un elemento del DataFrame con columna y fila:

In [34]:
df['Age'][0]

22

También podemos crear un DataFrame a partir de una lista de listas:

In [35]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [39]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [40]:
df[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [41]:
type(df[0])

pandas.core.series.Series

In [51]:
eye = pd.Series([220,215,93,64],
                index=['Brown', 'Blue', 'Hazel', 'Green'],
               name='eye_color')
eye

Brown    220
Blue     215
Hazel     93
Green     64
Name: eye_color, dtype: int64

In [54]:
eye.name

'eye_color'

In [52]:
eye.index

Index(['Brown', 'Blue', 'Hazel', 'Green'], dtype='object')

In [53]:
eye.values

array([220, 215,  93,  64])

In [55]:
eye.sort_values()

Green     64
Hazel     93
Blue     215
Brown    220
Name: eye_color, dtype: int64

In [56]:
eye.sort_index()

Blue     215
Brown    220
Green     64
Hazel     93
Name: eye_color, dtype: int64

In [57]:
eye.unique()

array([220, 215,  93,  64])

In [58]:
eye.nunique()

4

Vamos a ver qué sucede si duplicamos valores (nombres de índice repetidos)

In [59]:
my_data2 = [220, 215, 93, 64, 64]

In [60]:
eye2 = pd.Series(data=my_data2, index=['Brown', 'Blue', 'Blue', 'Hazel', 'Green'])
eye2

Brown    220
Blue     215
Blue      93
Hazel     64
Green     64
dtype: int64

In [61]:
eye2.unique()

array([220, 215,  93,  64])

In [62]:
eye2.nunique()

4

In [63]:
eye2.value_counts()

64     2
220    1
215    1
93     1
dtype: int64

Con las series es posible indexar y realizar *slices* igual que con los arrays Numpy:

In [64]:
ser = pd.Series([0, 10, 20, 30, 40], index=['a', 'b', 'c', 'd', 'e'])
ser

a     0
b    10
c    20
d    30
e    40
dtype: int64

In [67]:
ser[1] # observa que 1 no forma parte de los índices, se refiere a la 2a posición

10

In [68]:
ser['b']

10

In [69]:
ser[1:3]

b    10
c    20
dtype: int64

In [70]:
ser['b':'c'] # OPSSSSSSS en este slice el último sí está incluído 🤦‍♂️

b    10
c    20
dtype: int64

### Operaciones con series

In [71]:
ser1 = pd.Series([0,1,2,3,4], index=[0,1,2,3,4])
ser1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [72]:
ser2 = pd.Series([0,1,2,3,4], index=[4,3,2,1,0])
ser2

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [73]:
ser1+ser2

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [75]:
ser1*ser2

0    0
1    3
2    4
3    3
4    0
dtype: int64

In [76]:
ser1/ser2

0    0.000000
1    0.333333
2    1.000000
3    3.000000
4         inf
dtype: float64

In [77]:
ser1.sum()

10

In [78]:
ser1.mean()

2.0

In [79]:
ser1.median()

2.0

In [80]:
ser1.max()

4

In [81]:
ser1.min()

0

In [82]:
ser1.std()

1.5811388300841898

In [85]:
ser2

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [86]:
ser2.sort_values()

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [87]:
ser2.sort_index()

0    4
1    3
2    2
3    1
4    0
dtype: int64

Aplicar funciones a series:

In [88]:
ser_height = pd.Series([160,170,180], name='height')
ser_height

0    160
1    170
2    180
Name: height, dtype: int64

In [89]:
def plus_10(x):
    return x+10

In [90]:
plus_10(5)

15

In [91]:
ser_height.apply(plus_10)

0    170
1    180
2    190
Name: height, dtype: int64

In [92]:
# también podemos poner una función lambda como argumento del método apply:
ser_height.apply(lambda x : x+10)

0    170
1    180
2    190
Name: height, dtype: int64

### Practicando con Series y DataFrames

In [94]:
iris_df = pd.read_csv('data_iris.csv')
iris_df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [95]:
type(iris_df)

pandas.core.frame.DataFrame

In [98]:
# recordemos que es posible construir un DataFrame a partir de un diccionario:
data = {'NAME':['Jake', 'Jeniffer', 'Paul', 'Andrew'],
        'AGE':[24,21,25,19],
        'GENDER':['M', 'F', 'M', 'M']}

In [100]:
df = pd.DataFrame(data)
df

       NAME  AGE GENDER
0      Jake   24      M
1  Jeniffer   21      F
2      Paul   25      M
3    Andrew   19      M

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    4 non-null      object
 1   AGE     4 non-null      int64
 2   GENDER  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [104]:
iris_df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [105]:
iris_df.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [106]:
iris_df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [107]:
iris_df.tail(3)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [108]:
iris_df.sample(4)

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width     Species
89           5.5          2.5           4.0          1.3  versicolor
95           5.7          3.0           4.2          1.2  versicolor
35           5.0          3.2           1.2          0.2      setosa
71           6.1          2.8           4.0          1.3  versicolor

In [109]:
iris_df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [110]:
iris_df.index

RangeIndex(start=0, stop=150, step=1)

In [112]:
# podemos cambiar el nombre de las columnas:

iris_df.columns = ['Sepal_Length', 'Sepal_Width', 'Petal_Lenght', 'Petal_Width', 'Species']

In [113]:
iris_df.head()

   Sepal_Length  Sepal_Width  Petal_Lenght  Petal_Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [114]:
# una posible forma de indexar una columna:
iris_df.Sepal_Length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [115]:
# otra forma que funciona incluso si el nombre de la columna tiene espacios, etc.
iris_df['Sepal_Length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [116]:
# podemos acceder a más de una columna, PERO OBSERVA que devuelve un DataFrame:
iris_df[['Sepal_Length','Sepal_Width']]

     Sepal_Length  Sepal_Width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [117]:
# en particular, devuelve un DataFrame incluso si le pasamos una única columna:
iris_df[['Sepal_Length']]

     Sepal_Length
0             5.1
1             4.9
2             4.7
3             4.6
4             5.0
..            ...
145           6.7
146           6.3
147           6.5
148           6.2
149           5.9

[150 rows x 1 columns]

También podemos crear un DataFrame a partir de un array bidimensional:

In [118]:
array = [['Name', 'Age', 'Sex', 'School'],
         ['Tom', 15, 'Male', 'middle'],
         ['Alice', 10, 'Female', 'elementary']]

In [119]:
df = pd.DataFrame(array)
df # observa la primera columna:

       0    1       2           3
0   Name  Age     Sex      School
1    Tom   15    Male      middle
2  Alice   10  Female  elementary

In [125]:
df = pd.DataFrame([['Alice', 10, 'Female', 'elementary'],
                   ['Tom', 15, 'Male', 'middle']],
                  columns=['Name', 'Age', 'Sex', 'School'])
df

    Name  Age     Sex      School
0  Alice   10  Female  elementary
1    Tom   15    Male      middle

In [126]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [127]:
df.index = ['stu1', 'stu2']
df

       Name  Age     Sex      School
stu1  Alice   10  Female  elementary
stu2    Tom   15    Male      middle

In [128]:
df.index # slide 202

Index(['stu1', 'stu2'], dtype='object')

In [129]:
# de forma similar podemos modificar los nombres de las columnas:

df.columns = ['student_name', 'years', 'sex2', 'school2']
df

     student_name  years    sex2     school2
stu1        Alice     10  Female  elementary
stu2          Tom     15    Male      middle

In [130]:
df.rename(index={'stu1':'student1'}) # devuelve otro DataFrame:

         student_name  years    sex2     school2
student1        Alice     10  Female  elementary
stu2              Tom     15    Male      middle

In [132]:
df # pero el DataFrame original no ha cambiado:

     student_name  years    sex2     school2
stu1        Alice     10  Female  elementary
stu2          Tom     15    Male      middle

In [133]:
# vamos a repetir pero ahora utilizamos inplace=True

df.rename(index={'stu1':'student1'}, inplace=True) # ops! observa que no devuelve nada

In [134]:
df # pero ahora df ha cambiado

         student_name  years    sex2     school2
student1        Alice     10  Female  elementary
stu2              Tom     15    Male      middle

Una alternativa a utilizar `inplace=True` es reasignar el valor devuelto a la variable

> **Ojo:** Esto no es lo mismo si hay varias variables referenciando al DataFrame

In [135]:
df = df.rename(index={'stu2':'student2'})

In [136]:
df

         student_name  years    sex2     school2
student1        Alice     10  Female  elementary
student2          Tom     15    Male      middle

In [137]:
# con `rename` también podemos reemplazar nombres de columnas:
df.rename(columns={'student_name':'stu_name'}, inplace=True)

In [138]:
df

         stu_name  years    sex2     school2
student1    Alice     10  Female  elementary
student2      Tom     15    Male      middle

In [141]:
# podemos cambiar más de un nombre y filas y columnas al mismo tiempo.
# ¿qué pasa si una entrada no existe? vamos a verlo:

df.rename(index={'student1':'estudiante1', 'student2':'estudiante2', 'student3':'estudiante3'},
          columns={'sex2':'sex', 'school2':'school'})

# como no hemos puesto inplace=True devolverá un nuevo DataFrame pero df no sufrirá cambios

            stu_name  years     sex      school
estudiante1    Alice     10  Female  elementary
estudiante2      Tom     15    Male      middle

### Borrando filas y columnas

Utilizaremos el método `drop`:

In [167]:
exam_data = {'math'   : [ 90,  80,  70],
             'eng'    : [ 98,  89,  95],
             'music'  : [ 85,  95, 100],
             'science': [100,  90,  90]}

In [168]:
df = pd.DataFrame(exam_data, index=['stu1', 'stu2', 'stu3'])
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [169]:
# en las slides copian con un slice poniendo df2=df[:] 
# luego veremos que no es lo mismo exactamente
df2 = df.copy()

In [170]:
df2

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [171]:
df2.drop('stu2', inplace=True) # nuevamente, un inplace=True hace que no devuelva nada

In [172]:
df2

      math  eng  music  science
stu1    90   98     85      100
stu3    70   95    100       90

In [173]:
df # el original

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [174]:
# obviamente podemos borrar varias filas al mismo tiempo:
df3 = df.drop(['stu2','stu3'], axis=0) # observa que NO hemos puesto inplace=True
df3

      math  eng  music  science
stu1    90   98     85      100

In [175]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

Observa las diferencias entre copiar con [:] y con .copy()

El primero da un warning

```
SettingWithCopyWarning: 
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(
```

In [177]:
df4 = df[:]
df4.drop('math', axis=1, inplace=True)
df4

/usr/lib/python3/dist-packages/pandas/core/frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

      eng  music  science
stu1   98     85      100
stu2   89     95       90
stu3   95    100       90

Ahora lo repetimos utilizando `.copy()`:

In [179]:
df4 = df.copy()
df4.drop('math', axis=1, inplace=True)
df4

      eng  music  science
stu1   98     85      100
stu2   89     95       90
stu3   95    100       90

In [180]:
df # la original sigue con la columna borrada en df4

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [181]:
# podemos borrar varias columnas:
df5 = df.drop(['eng','science'], axis=1, inplace=False) # o no poner inplace
df5

      math  music
stu1    90     85
stu2    80     95
stu3    70    100

### Seleccionar elementos

In [182]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [183]:
df.loc['stu1']

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [184]:
type(df.loc['stu1'])

pandas.core.series.Series

In [185]:
df.iloc[0]

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [186]:
df.loc[['stu1','stu3']] # no necesitan ser filas contiguas

      math  eng  music  science
stu1    90   98     85      100
stu3    70   95    100       90

In [187]:
df.iloc[[0,2]]

      math  eng  music  science
stu1    90   98     85      100
stu3    70   95    100       90

Seleccionar columnas

In [188]:
math1 = df['math']
math1

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [190]:
english = df.eng
english

stu1    98
stu2    89
stu3    95
Name: eng, dtype: int64

In [191]:
music_sci = df[['music','science']]
music_sci

      music  science
stu1     85      100
stu2     95       90
stu3    100       90

In [192]:
df.math

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [193]:
df['math']

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [194]:
df[['math']]

      math
stu1    90
stu2    80
stu3    70

In [248]:
exam_data = {'name':['honglidong', 'hongeedong', 'hongsamdong'],
            'math':[90, 80, 70],
            'eng':[98, 89, 95],
            'music':[85, 95, 100],
            'phys_tra':[100, 90, 90]}

In [249]:
df = pd.DataFrame(exam_data)
df

          name  math  eng  music  phys_tra
0   honglidong    90   98     85       100
1   hongeedong    80   89     95        90
2  hongsamdong    70   95    100        90

In [250]:
df.index

RangeIndex(start=0, stop=3, step=1)

### Designar un índice

Podemos utilizar una de las columnas como índice:

In [251]:
df.set_index('name', inplace=True)

In [252]:
df

             math  eng  music  phys_tra
name
honglidong     90   98     85       100
hongeedong     80   89     95        90
hongsamdong    70   95    100        90

In [253]:
df.loc['honglidong']

math         90
eng          98
music        85
phys_tra    100
Name: honglidong, dtype: int64

In [254]:
df.loc['honglidong','music']

85

In [255]:
df.loc['honglidong',['music','phys_tra']]

music        85
phys_tra    100
Name: honglidong, dtype: int64

In [256]:
df.loc[['honglidong'],['music','phys_tra']]

            music  phys_tra
name
honglidong     85       100

In [257]:
df.loc[['honglidong','hongeedong'],['music','phys_tra']]

            music  phys_tra
name
honglidong     85       100
hongeedong     95        90

In [258]:
df.iloc[0,[2,3]]

music        85
phys_tra    100
Name: honglidong, dtype: int64

In [259]:
df.iloc[[2,0],[2,3]]

             music  phys_tra
name
hongsamdong    100        90
honglidong      85       100

Podemos usar *slices*, observa la diferencia entre `loc` e `iloc`:

In [260]:
df.loc['honglidong', 'eng':'phys_tra'] # el punto final del slice SÍ está incluido:

eng          98
music        85
phys_tra    100
Name: honglidong, dtype: int64

In [261]:
df.iloc[0,1:3]

eng      98
music    85
Name: honglidong, dtype: int64

In [262]:
# la columna de índice 3 no ha sido incluida, si accedemos únicamente a 3 sin slice sí que sale:
df.iloc[0,3]

100

In [263]:
# otro ejemplo de slice:
df.loc[['honglidong','hongeedong'],'music':'phys_tra']

            music  phys_tra
name
honglidong     85       100
hongeedong     95        90

### Añadir columnas

In [264]:
df['kor'] = 80
df # observa que en la nueva columna todos los valores valen 80

             math  eng  music  phys_tra  kor
name
honglidong     90   98     85       100   80
hongeedong     80   89     95        90   80
hongsamdong    70   95    100        90   80

### Añadir filas

In [265]:
df.index

Index(['honglidong', 'hongeedong', 'hongsamdong'], dtype='object', name='name')

In [266]:
df.loc['Juan'] = 0
df

             math  eng  music  phys_tra  kor
name
honglidong     90   98     85       100   80
hongeedong     80   89     95        90   80
hongsamdong    70   95    100        90   80
Juan            0    0      0         0    0

In [267]:
df.loc[2] = 0 # observa que aunque pongamos un 2 es .loc
df

             math  eng  music  phys_tra  kor
name
honglidong     90   98     85       100   80
hongeedong     80   89     95        90   80
hongsamdong    70   95    100        90   80
Juan            0    0      0         0    0
2               0    0      0         0    0

In [268]:
df.loc[2] = [90, 80, 70, 60, 77] # ya existe una columna con ese nombre
df

             math  eng  music  phys_tra  kor
name
honglidong     90   98     85       100   80
hongeedong     80   89     95        90   80
hongsamdong    70   95    100        90   80
Juan            0    0      0         0    0
2              90   80     70        60   77

In [269]:
df.index # al

Index(['honglidong', 'hongeedong', 'hongsamdong', 'Juan', 2], dtype='object', name='name')

In [270]:
df.index[3]

'Juan'

### Resetar el índice

In [271]:
df

             math  eng  music  phys_tra  kor
name
honglidong     90   98     85       100   80
hongeedong     80   89     95        90   80
hongsamdong    70   95    100        90   80
Juan            0    0      0         0    0
2              90   80     70        60   77

In [272]:
df.reset_index()

          name  math  eng  music  phys_tra  kor
0   honglidong    90   98     85       100   80
1   hongeedong    80   89     95        90   80
2  hongsamdong    70   95    100        90   80
3         Juan     0    0      0         0    0
4            2    90   80     70        60   77

In [273]:
df

             math  eng  music  phys_tra  kor
name
honglidong     90   98     85       100   80
hongeedong     80   89     95        90   80
hongsamdong    70   95    100        90   80
Juan            0    0      0         0    0
2              90   80     70        60   77

In [274]:
df.reset_index(inplace=True) # admite inplace=True

In [275]:
df

          name  math  eng  music  phys_tra  kor
0   honglidong    90   98     85       100   80
1   hongeedong    80   89     95        90   80
2  hongsamdong    70   95    100        90   80
3         Juan     0    0      0         0    0
4            2    90   80     70        60   77

**¡CUIDADO!** si vuelves a hacer reset_index crea una columna...

In [276]:
df_prueba = df.copy()
df_prueba

          name  math  eng  music  phys_tra  kor
0   honglidong    90   98     85       100   80
1   hongeedong    80   89     95        90   80
2  hongsamdong    70   95    100        90   80
3         Juan     0    0      0         0    0
4            2    90   80     70        60   77

In [277]:
df_prueba.reset_index()

   index         name  math  eng  music  phys_tra  kor
0      0   honglidong    90   98     85       100   80
1      1   hongeedong    80   89     95        90   80
2      2  hongsamdong    70   95    100        90   80
3      3         Juan     0    0      0         0    0
4      4            2    90   80     70        60   77

In [278]:
df.iloc[4,0] = 'hongsadong' # se refiere a df, no a df_prueba
df

          name  math  eng  music  phys_tra  kor
0   honglidong    90   98     85       100   80
1   hongeedong    80   89     95        90   80
2  hongsamdong    70   95    100        90   80
3         Juan     0    0      0         0    0
4   hongsadong    90   80     70        60   77

In [279]:
# volvemos a poner la columna name como índice:
df.set_index('name', inplace=True)
df

             math  eng  music  phys_tra  kor
name
honglidong     90   98     85       100   80
hongeedong     80   89     95        90   80
hongsamdong    70   95    100        90   80
Juan            0    0      0         0    0
hongsadong     90   80     70        60   77

In [283]:
# slide 244

exam_data = {'name':['stu1', 'stu2', 'stu3'],
            'math':[90, 80, 70],
            'eng':[98, 89, 95],
            'mus':[85, 95, 100],
            'phy':[100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   name  math  eng  mus  phy
0  stu1    90   98   85  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [284]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [286]:
df.set_index('name', inplace=True)
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [287]:
df.index

Index(['stu1', 'stu2', 'stu3'], dtype='object', name='name')

In [288]:
df.iloc[0,3] = 80
df

      math  eng  mus  phy
name
stu1    90   98   85   80
stu2    80   89   95   90
stu3    70   95  100   90

In [290]:
df.loc['stu1']['phy'] = 90
df

      math  eng  mus  phy
name
stu1    90   98   85   90
stu2    80   89   95   90
stu3    70   95  100   90

In [291]:
df.loc['stu1']['phy'] = 100
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [292]:
df.loc['stu1']['mus','phy'] = 50
df

      math  eng  mus  phy
name
stu1    90   98   50   50
stu2    80   89   95   90
stu3    70   95  100   90

In [293]:
df.loc['stu1']['mus','phy'] = 70,80
df

      math  eng  mus  phy
name
stu1    90   98   70   80
stu2    80   89   95   90
stu3    70   95  100   90

In [294]:
df.reset_index(inplace=True)

In [295]:
df

   name  math  eng  mus  phy
0  stu1    90   98   70   80
1  stu2    80   89   95   90
2  stu3    70   95  100   90

### Transponer el DataFrame

In [296]:
dff = df.transpose()
dff

         0     1     2
name  stu1  stu2  stu3
math    90    80    70
eng     98    89    95
mus     70    95   100
phy     80    90    90

In [297]:
# también podemos utilizar la propiedad .T

dff.T

   name math eng  mus phy
0  stu1   90  98   70  80
1  stu2   80  89   95  90
2  stu3   70  95  100  90

In [298]:
# slide 254

exam_data = {'name':['stu1', 'stu2', 'stu3'],
            'math':[90, 80, 70],
            'eng':[98, 89, 95],
            'mus':[85, 95, 100],
            'phy':[100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   name  math  eng  mus  phy
0  stu1    90   98   85  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [299]:
ndf = df.set_index(['name'])
ndf

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [300]:
ndf2 = ndf.set_index('mus')
ndf2

     math  eng  phy
mus
85     90   98  100
95     80   89   90
100    70   95   90

In [304]:
ndf3 = ndf.set_index(['math','mus'])
ndf3

          eng  phy
math mus
90   85    98  100
80   95    89   90
70   100   95   90

In [305]:
ndf3.index

MultiIndex([(90,  85),
            (80,  95),
            (70, 100)],
           names=['math', 'mus'])

In [306]:
dic_data = {'c0':[ 1, 2, 3],
            'c1':[ 4, 5, 6],
            'c2':[ 7, 8, 9],
            'c3':[10,11,12],
            'c4':[13,14,15],
           }
df = pd.DataFrame(dic_data, index=['r0','r1','r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [307]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [308]:
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [309]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [310]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [311]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [312]:
ndf = df.sort_index(ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [313]:
# slide 265
ndf = df.sort_values(by='c1', ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

### Series operators

In [314]:
student1 = pd.Series({'kor':100, 'eng':80, 'math':90})
student1

kor     100
eng      80
math     90
dtype: int64

In [316]:
percentage = student1 / 100
percentage

kor     1.0
eng     0.8
math    0.9
dtype: float64

In [317]:
student1 = pd.Series({'kor' :100, 'eng':80, 'math':90})
student2 = pd.Series({'math': 80, 'kor':90, 'eng' :80}) # el orden difiere
student2

math    80
kor     90
eng     80
dtype: int64

In [318]:
student1.index

Index(['kor', 'eng', 'math'], dtype='object')

In [319]:
student2.index

Index(['math', 'kor', 'eng'], dtype='object')

In [320]:
student1 + student2

eng     160
kor     190
math    170
dtype: int64

In [321]:
student2 + student1

eng     160
kor     190
math    170
dtype: int64

In [322]:
student1 - student2

eng      0
kor     10
math    10
dtype: int64

In [323]:
student1 * student2

eng     6400
kor     9000
math    7200
dtype: int64

In [324]:
result = pd.DataFrame([student1 + student2,
                       student1 - student2,
                       student1 * student2,
                       student1 / student2],
                     index=['addition', 'subtraction','multiplication','division'])
result # el orden de las columnas difiere de las slides Samsung

                   eng          kor      math
addition         160.0   190.000000   170.000
subtraction        0.0    10.000000    10.000
multiplication  6400.0  9000.000000  7200.000
division           1.0     1.111111     1.125

Cuando un valor no está en una de las series se entiende que vale NaN (forma que tiene Pandas para indicar missing values, realmente NaN no se pensó para eso :( )

In [325]:
student1 = pd.Series({'kor' :np.nan, 'eng':80, 'math':90})
student2 = pd.Series({'math': 80, 'kor':90})

In [326]:
pd.DataFrame([student1 + student2,
              student1 - student2,
              student1 * student2,
              student1 / student2],
             index=['addition', 'subtraction','multiplication','division'])

                eng  kor      math
addition        NaN  NaN   170.000
subtraction     NaN  NaN    10.000
multiplication  NaN  NaN  7200.000
division        NaN  NaN     1.125

Podemos utilizar `fill_value` como sigue, observa que las operaciones suma, resta, etc. se realizan con un método en lugar de los operadores +,-, etc.

In [327]:
student1 = pd.Series({'kor' :np.nan, 'eng':80, 'math':90})
student2 = pd.Series({'math': 80, 'kor':90})

sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)
sr_mul = student1.mul(student2, fill_value=0)
sr_div = student1.div(student2, fill_value=0)

pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
             index=['addition', 'subtraction','multiplication','division'])

                 eng   kor      math
addition        80.0  90.0   170.000
subtraction     80.0 -90.0    10.000
multiplication   0.0   0.0  7200.000
division         inf   0.0     1.125

**Nota:** Aunque la biblioteca Seaborn se verá más adelante, ahora la vamos a utilizar para  importar datos:

In [328]:
import seaborn as sns

In [331]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [332]:
df = titanic.loc[:,['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [336]:
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [334]:
addition = df + 10
addition

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [335]:
subtraction = addition - df
subtraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

### Unit 2.3 Merging and Binding DataFrames

In [337]:
dfA = pd.DataFrame({
    'Name':'Harry Potter,David Baker,John Smith,Juan Martinez,Jane Connor'.split(','),
    'Gender':'Male Male Male Male Female'.split(),
    'Age':[23,31,22,36,30]
    
})
dfA

            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   30

In [338]:
dfB = pd.DataFrame({
    'Name':'John Smith,Alex Du Bois,Joanne Rowling,Jane Connor'.split(','),
    'Position':'Intern,Team Lead,Manager,Manager'.split(','),
    'Wage':[25000,75000,90000,70000]
    
})
dfB

             Name   Position   Wage
0      John Smith     Intern  25000
1    Alex Du Bois  Team Lead  75000
2  Joanne Rowling    Manager  90000
3     Jane Connor    Manager  70000

In [339]:
pd.merge(dfA,dfB,on='Name',how='left')

            Name  Gender  Age Position     Wage
0   Harry Potter    Male   23      NaN      NaN
1    David Baker    Male   31      NaN      NaN
2     John Smith    Male   22   Intern  25000.0
3  Juan Martinez    Male   36      NaN      NaN
4    Jane Connor  Female   30  Manager  70000.0

In [340]:
pd.merge(dfA,dfB,how='right')

             Name  Gender   Age   Position   Wage
0      John Smith    Male  22.0     Intern  25000
1    Alex Du Bois     NaN   NaN  Team Lead  75000
2  Joanne Rowling     NaN   NaN    Manager  90000
3     Jane Connor  Female  30.0    Manager  70000

In [341]:
pd.merge(dfA,dfB,how='outer')

             Name  Gender   Age   Position     Wage
0    Harry Potter    Male  23.0        NaN      NaN
1     David Baker    Male  31.0        NaN      NaN
2      John Smith    Male  22.0     Intern  25000.0
3   Juan Martinez    Male  36.0        NaN      NaN
4     Jane Connor  Female  30.0    Manager  70000.0
5    Alex Du Bois     NaN   NaN  Team Lead  75000.0
6  Joanne Rowling     NaN   NaN    Manager  90000.0